package com.athuiru.exer;

/**
 * String[]l[] employees = {
 * {"10","1","段誉","22","3000"},
 * {"13","2","令狐冲","32","18000","15000","2000"},
 * {"11","3","任我行","23","7000"},{"11","4","张三丰","24", "7300",
 * {"12","5",,"周芷若","28″, "10000","5000"},{"11","6","赵敏","22","6800"},
 * {"12","7","张无忌","29","10800","5200"},
 * {"13","8","韦小宝","30","19800","15000","2500"},{"12","9","杨过","26","98004"5500"},
 * {"11","10","小龙女","21","6600"},{"11","11","郭靖","25","7100"},
 * {"12","12","黄蓉","27","9600","4800"};
 */
public class ArrayExer04 {
    public static void main(String[] args) {
        String[][] employees = {
                {"10", "1", "段誉", "22", "3000"},
                {"13", "2", "令狐冲", "32", "18000", "15000", "2000"},
                {"11", "3", "任我行", "23", "7000"},
                {"11", "4", "张三丰", "24", "7300"},
                {"12", "5", "周芷若", "28", "10000", "5000"},
                {"11", "6", "赵敏", "22", "6800"},
                {"12", "7", "张无忌", "29", "10800", "5200"},
                {"13", "8", "韦小宝", "30", "19800", "15000", "2500"},
                {"12", "9", "杨过", "26", "98004", "5500"},
                {"11", "10", "小龙女", "21", "6600"},
                {"11", "11", "郭靖", "25", "7100"},
                {"12", "12", "黄蓉", "27", "9600", "4800"}};

        System.out.println("员工类型\t" + "编号\t" + "姓名\t" + "年龄\t" + "薪资\t" + "奖金\t" + "股票\t");
        for (int i = 0; i < employees.length; i++) {
            String type = getEmployeeType(employees[i][0]);
            System.out.print(type + "\t");
            for (int j = 1; j < employees[i].length; j++) {
                System.out.print(employees[i][j] + "\t");
            }
            System.out.println();
        }
    }

    private static String getEmployeeType(String typeNum) {
        switch (typeNum) {
            case "10":
                return "普通职员";
            case "11":
                return "程序员";
            case "12":
                return "设计师";
            case "13":
                return "架构师";
            default:
                return "无该类型";
        }
    }
}
